Happy to help @renatosis :) 

hmm 🤔 I have just created a deployment with what I sent earlier as an example and it worked fine.

```shell
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ec_deployment.example_minimal will be created
  + resource "ec_deployment" "example_minimal" {
      + apm_secret_token       = (sensitive value)
      + deployment_template_id = "aws-io-optimized-v2"
      + elasticsearch_password = (sensitive value)
      + elasticsearch_username = (known after apply)
      + id                     = (known after apply)
      + region                 = "us-east-1"
      + version                = "7.10.1"

      + elasticsearch {
          + cloud_id       = (known after apply)
          + http_endpoint  = (known after apply)
          + https_endpoint = (known after apply)
          + ref_id         = "main-elasticsearch"
          + region         = (known after apply)
          + resource_id    = (known after apply)
          + version        = (known after apply)

          + topology {
              + instance_configuration_id = "aws.master.r5d"
              + node_type_data            = "false"
              + node_type_ingest          = "false"
              + node_type_master          = "true"
              + node_type_ml              = (known after apply)
              + size                      = "2g"
              + size_resource             = "memory"
              + zone_count                = (known after apply)
            }
          + topology {
              + instance_configuration_id = "aws.data.highio.i3"
              + node_type_data            = "true"
              + node_type_ingest          = "true"
              + node_type_master          = "false"
              + node_type_ml              = (known after apply)
              + size                      = "174g"
              + size_resource             = "memory"
              + zone_count                = (known after apply)
            }
        }

      + kibana {
          + elasticsearch_cluster_ref_id = "main-elasticsearch"
          + http_endpoint                = (known after apply)
          + https_endpoint               = (known after apply)
          + ref_id                       = "main-kibana"
          + region                       = (known after apply)
          + resource_id                  = (known after apply)
          + version                      = (known after apply)

          + topology {
              + instance_configuration_id = (known after apply)
              + size                      = (known after apply)
              + size_resource             = (known after apply)
              + zone_count                = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ec_deployment.example_minimal: Creating...
ec_deployment.example_minimal: Still creating... [10s elapsed]
<...>
ec_deployment.example_minimal: Creation complete after 3m58s [id=4f110411fe6da4d8b075e9a0c7f41163]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Could you paste the contents of your .tf file here so we can further debug?